code-review/NRB_3471_3546/База_Было/DataProcessors/ФормированиеУведомленийООперацияхЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ФормированиеУведомленийООперацияхЦБ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОсновнаяНастройкаОтправкиУведомлений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиОбменаДанными</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаОтправкиУведомленийОСписанииЦБПоФл</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиОбменаДанными</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Данные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поручение</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВстречноеПоручение</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Депонент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТемаПисьма</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НастройкаОтправки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НастройкиОбменаДанными</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстПисьма</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Documents/ОперацииЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ОперацииЦБ</Name>
			<BasedOn>
				<xr:Item>Document.Поручение</xr:Item>
				<xr:Item>Document.ЦБВПути</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиЦБДепозитарийМХ</xr:Item>
				<xr:Item>AccumulationRegister.ЗаблокированныеЦБвВышестоящемДепозитарии</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиЦБМестоРасчетов</xr:Item>
				<xr:Item>AccumulationRegister.УслугиДепозитария</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиЦБ</xr:Item>
				<xr:Item>AccumulationRegister.ЦБВПути</xr:Item>
				<xr:Item>InformationRegister.СтатусыПоручений</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокировочныйРазделСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперацииД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсполненияВДепозитарииМХ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсполненияВМестеРасчетов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСделки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Депонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЦБВПути</v8:Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
						<v8:Type>cfg:DocumentRef.иц_СводноеПоручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснованиеВстречный</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Залогодержатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЗагрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнициаторВстречный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассОпераций</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КлассыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий100</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Биржи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХраненияПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоПоручения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтрокиОснования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСчетаДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСчетаДепоМХПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСчетаДепоПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетыНаDMA</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Референс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнойВвод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособХранения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепоМХПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепоПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифныйПлан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеПланы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>9</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОтчетаНРД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/DataProcessors/ФормированиеУведомленийООперацияхЦБ/Ext/ObjectModule.bsl
Процедура ПодготовитьУведомленияОИсполненииОперацииЦБ(ПредыдущийДень = Ложь) Экспорт
	
	Данные.Очистить();
	Если Не ЗначениеЗаполнено(ОсновнаяНастройкаОтправкиУведомлений) Тогда
		ОписаниеОшибки = "Не заполнены параметры внешнего источника '"+ПланыВидовХарактеристик.ВнешниеИсточники.РассылкаУведомленийОИсполненииПорученийНаОперацииСЦБ+"'";
		ЗаписьЖурналаРегистрации("Уведомление о исполнении поручений на операции с ЦБ", УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки);
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НастройкаОтправкиУведомленийОСписанииЦБПоФл) Тогда
		ОписаниеОшибки = "Не заполнены параметры внешнего источника '"+ПланыВидовХарактеристик.ВнешниеИсточники.РассылкаУведомленийОИсполненииПорученийНаОперацииСЦБ+"'";
		ЗаписьЖурналаРегистрации("Уведомление о исполнении поручений на операции с ЦБ", УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаДляПодготовкиУведомлений();
	Запрос.УстановитьПараметр("Перевод", Справочники.ВидыОпераций.Перевод);
	Запрос.УстановитьПараметр("ЗаПредыдущийДень", ПредыдущийДень);
	Запрос.УстановитьПараметр("ДатаТекущийДень", НачалоДня(ТекущаяДата()));
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
		
		ВидОперации = Выборка.ВидОперации;
		ТекущиеНастройкиОтправки = ОсновнаяНастройкаОтправкиУведомлений;
		ПереносСтроки = Символы.ПС + "<br>";
		Если ВидОперации = Справочники.ВидыОпераций.СнятиеСДепонирования Тогда
			ТемаПисьма = "Cписаны ЦБ";
			Если Выборка.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
				ТекущиеНастройкиОтправки = НастройкаОтправкиУведомленийОСписанииЦБПоФл;
			КонецЕсли;
			ТекстПисьма = ТекстПисьмаДляСписанияЗачисленияЦБ(Выборка, ПереносСтроки);
		ИначеЕсли ВидОперации = Справочники.ВидыОпераций.Депонирование Тогда
			ТемаПисьма = "Зачислены ЦБ";
			ТекстПисьма = ТекстПисьмаДляСписанияЗачисленияЦБ(Выборка, ПереносСтроки);
		ИначеЕсли ВидОперации = Справочники.ВидыОпераций.Перевод Тогда
			ТемаПисьма = "Перевод ЦБ между договорами клиентов (без движения в м/х)";
			ТекстПисьма = ТекстПисьмаДляПереводаЦБ(Выборка, ПереносСтроки);
			Если Выборка.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
				ТекущиеНастройкиОтправки = НастройкаОтправкиУведомленийОСписанииЦБПоФл;
			КонецЕсли;
		ИначеЕсли ВидОперации = Справочники.ВидыОпераций.ПереводМеждуРазделамиСчетаДепо Тогда
			ТемаПисьма = "Перевод ЦБ внутри одного счета депо (+ изменение места хранения)";
			ТекстПисьма = ТекстПисьмаДляПереводовВнутриОдногоСчета(Выборка, ПереносСтроки);
		ИначеЕсли ВидОперации = Справочники.ВидыОпераций.Перемещение Тогда
			ТемаПисьма = "Перевод ЦБ между счетами одного клиента (изменение места хранения)";
			ТекстПисьма = ТекстПисьмаДляПеремещений(Выборка, ПереносСтроки);
		КонецЕсли;
		
		НоваяСтрока = Данные.Добавить();
		НоваяСтрока.Поручение = Выборка.Поручение;
		НоваяСтрока.ВстречноеПоручение = Выборка.ВстречноеПоручение;
		НоваяСтрока.Депонент = Выборка.Депонент;
		НоваяСтрока.ТемаПисьма = ТемаПисьма;
		НоваяСтрока.НастройкаОтправки = ТекущиеНастройкиОтправки;
		НоваяСтрока.ТекстПисьма = ТекстПисьма;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СформироватьПодготовленныеУведомления() Экспорт
	
	ГруппировкиОбхода = Данные.Выгрузить();
	ГруппировкиОбхода.Свернуть("Депонент, ТемаПисьма, НастройкаОтправки");
	Для Каждого ГруппировкаОбхода Из ГруппировкиОбхода Цикл
		
		Отбор = Новый Структура;
		Отбор.Вставить("Депонент", ГруппировкаОбхода.Депонент);
		Отбор.Вставить("ТемаПисьма", ГруппировкаОбхода.ТемаПисьма);
		Отбор.Вставить("НастройкаОтправки", ГруппировкаОбхода.НастройкаОтправки);
		СтрокиПоГруппировке = Данные.НайтиСтроки(Отбор);
		
		ДатаФормирования = ТекущаяДата();
		ТекстПисьма = "";
		НачатьТранзакцию();
		Попытка
			
			Для Каждого Стр Из СтрокиПоГруппировке Цикл
				
				Если Не ПустаяСтрока(ТекстПисьма) Тогда
					ТекстПисьма = ТекстПисьма + Символы.ПС + "<br>" + Символы.ПС + "<br>";
				КонецЕсли;
				
				ТекстПисьма = ТекстПисьма + Стр.ТекстПисьма;
				
				ЗаписатьСостояниеПодготовленДляПоручения(Стр.Поручение, ДатаФормирования);
				Если ЗначениеЗаполнено(Стр.ВстречноеПоручение) Тогда
					ЗаписатьСостояниеПодготовленДляПоручения(Стр.ВстречноеПоручение, ДатаФормирования);
				КонецЕсли;
				
			КонецЦикла;
			
			ПараметрыУведомления = Новый Соответствие;
			ПараметрыУведомления.Вставить("НастройкиОбмена"	, ГруппировкаОбхода.НастройкаОтправки);
			ПараметрыУведомления.Вставить("ТемаПисьма"		, ГруппировкаОбхода.ТемаПисьма);
			ПараметрыУведомления.Вставить("ТекстПисьма"		, ТекстПисьма);
			ПараметрыУведомления.Вставить("ТипТекстаПисьма"	, ТипТекстаПочтовогоСообщения.HTML);
			ПараметрыУведомления.Вставить("Кодировка"		, "UTF-8");
			ПараметрыУведомления.Вставить("Важность"		, ВажностьИнтернетПочтовогоСообщения.Обычная);
			РегистрыСведений.УведомленияКОтправке.ДобавитьУведомлениеКотправке(ПараметрыУведомления);
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
		
	КонецЦикла;
	Данные.Очистить();
	
КонецПроцедуры

Процедура ПолучитьПараметрыВнешнихИсточников() Экспорт
	
	ОсновнаяНастройкаОтправкиУведомлений = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ПланыВидовХарактеристик.ВнешниеИсточники.РассылкаУведомленийОИсполненииПорученийНаОперацииСЦБ).Настройка;
	НастройкаОтправкиУведомленийОСписанииЦБПоФл = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ПланыВидовХарактеристик.ВнешниеИсточники.РассылкаУведомленийОИсполненииПорученийНаСписаниеЦБПоФЛ).Настройка;

КонецПроцедуры

Функция ТекстЗапросаДляПодготовкиУведомлений()
	
	Возврат
	"ВЫБРАТЬ
	|	СостоянияУведомленийОбОперацияхСЦБ.Поручение КАК ДокументПоручение
	|ПОМЕСТИТЬ НеподготовленныеУведомления
	|ИЗ
	|	РегистрСведений.СостоянияУведомленийОбОперацияхСЦБ КАК СостоянияУведомленийОбОперацияхСЦБ
	|ГДЕ
	|	НЕ СостоянияУведомленийОбОперацияхСЦБ.Подготовлено
	|	И ВЫБОР
	|			КОГДА &ЗаПредыдущийДень
	|				ТОГДА СостоянияУведомленийОбОперацияхСЦБ.Поручение.Дата < &ДатаТекущийДень
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Поручение.СчетДепоМХ КАК СчетДепоМХ,
	|	Поручение.СчетДепоМХКонтрагента КАК СчетДепоМХКонтрагента,
	|	Поручение.Депонент.Код КАК КодДепонента,
	|	Поручение.Контрагент.Код КАК КодКонтрагента,
	|	Поручение.РазделСчетаДепоМХ.Код КАК РазделСчетаДепоМХ,
	|	Поручение.РазделСчетаДепоМХКонтрагента.Код КАК РазделСчетаДепоМХКонтрагента,
	|	Поручение.РазделСчетаДепо.Код КАК РазделСчетаДепо,
	|	Поручение.РазделСчетаДепоКонтрагента.Код КАК РазделСчетаДепоКонтрагента,
	|	Поручение.СчетДепо КАК СчетДепо,
	|	Поручение.СчетДепоКонтрагента КАК СчетДепоКонтрагента,
	|	ПоручениеЦенныеБумагиСписываемые.ЦеннаяБумага.ISIN КАК ISIN,
	|	ПоручениеЦенныеБумагиСписываемые.Количество КАК КоличествоЦБ,
	|	ПоручениеЦенныеБумагиСписываемые.ЦеннаяБумага.Представление КАК ЦБПредставление,
	|	Поручение.Ссылка КАК Поручение,
	|	Поручение.Депонент КАК Депонент,
	|	Поручение.Контрагент КАК Контрагент,
	|	Поручение.ВидОперацииД КАК ВидОперации,
	|	Поручение.Депонент.ЮрФизЛицо КАК ЮрФизЛицо,
	|	Поручение.Номер КАК НомерПоручения,
	|	Поручение.Дата КАК ДатаПоручения,
	|	Поручение.ДатаИсполненияПоручения КАК ДатаИсполненияПоручения,
	|	Поручение.ИсточникЗагрузки КАК ИсточникЗагрузки,
	|	ЗНАЧЕНИЕ(Документ.Поручение.ПустаяСсылка) КАК ВстречноеПоручение,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаВстречногоПоручения,
	|	"""" КАК НомерВстречногоПоручения
	|ИЗ
	|	НеподготовленныеУведомления КАК НеподготовленныеУведомления
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Поручение КАК Поручение
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Поручение.ЦенныеБумагиСписываемые КАК ПоручениеЦенныеБумагиСписываемые
	|			ПО Поручение.Ссылка = ПоручениеЦенныеБумагиСписываемые.Ссылка
	|		ПО НеподготовленныеУведомления.ДокументПоручение = Поручение.Ссылка
	|ГДЕ
	|	Поручение.Ссылка ЕСТЬ НЕ NULL 
	|	И Поручение.ВидОперацииД <> &Перевод
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Поручение.СчетДепоМХ,
	|	Поручение.СчетДепоМХКонтрагента,
	|	Поручение.Депонент.Код,
	|	Поручение.Контрагент.Код,
	|	Поручение.РазделСчетаДепоМХ.Код,
	|	Поручение.РазделСчетаДепоМХКонтрагента.Код,
	|	Поручение.РазделСчетаДепо.Код,
	|	Поручение.РазделСчетаДепоКонтрагента.Код,
	|	Поручение.СчетДепо,
	|	Поручение.СчетДепоКонтрагента,
	|	Поручение.ЦБ.ISIN,
	|	Поручение.КоличествоЦБ,
	|	Поручение.ЦБ.Представление,
	|	Поручение.Ссылка,
	|	Поручение.Депонент,
	|	Поручение.Контрагент,
	|	Поручение.ВидОперацииД,
	|	Поручение.Депонент.ЮрФизЛицо,
	|	Поручение.Номер,
	|	Поручение.Дата,
	|	Поручение.ДатаИсполненияПоручения КАК ДатаИсполненияПоручения,
	|	Поручение.ИсточникЗагрузки КАК ИсточникЗагрузки,
	|	ОперацииЦБ.ДокументОснованиеВстречный,
	|	ОперацииЦБ.ДокументОснованиеВстречный.Дата,
	|	ОперацииЦБ.ДокументОснованиеВстречный.Номер
	|ИЗ
	|	НеподготовленныеУведомления КАК НеподготовленныеУведомления
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Поручение КАК Поручение
	|		ПО НеподготовленныеУведомления.ДокументПоручение = Поручение.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОперацииЦБ КАК ОперацииЦБ
	|		ПО НеподготовленныеУведомления.ДокументПоручение = ОперацииЦБ.ДокументОснование
	|			И (ОперацииЦБ.ДокументОснование = Поручение.Ссылка)
	|			И (ОперацииЦБ.Проведен)
	|ГДЕ
	|	Поручение.Ссылка ЕСТЬ НЕ NULL 
	|	И Поручение.ВидОперацииД = &Перевод
	|	И ОперацииЦБ.Ссылка ЕСТЬ НЕ NULL 
	|
	|УПОРЯДОЧИТЬ ПО
	|	Депонент,
	|	ВидОперации,
	|	ДатаПоручения
	|ИТОГИ
	|	МАКСИМУМ(СчетДепоМХ),
	|	МАКСИМУМ(СчетДепоМХКонтрагента),
	|	МАКСИМУМ(КодДепонента),
	|	МАКСИМУМ(КодКонтрагента),
	|	МАКСИМУМ(РазделСчетаДепоМХ),
	|	МАКСИМУМ(РазделСчетаДепоМХКонтрагента),
	|	МАКСИМУМ(РазделСчетаДепо),
	|	МАКСИМУМ(РазделСчетаДепоКонтрагента),
	|	МАКСИМУМ(СчетДепо),
	|	МАКСИМУМ(СчетДепоКонтрагента),
	|	МАКСИМУМ(Депонент),
	|	МАКСИМУМ(Контрагент),
	|	МАКСИМУМ(ВидОперации),
	|	МАКСИМУМ(ЮрФизЛицо),
	|	МАКСИМУМ(НомерПоручения),
	|	МАКСИМУМ(ДатаПоручения),
	|	МАКСИМУМ(ДатаИсполненияПоручения),
	|	МАКСИМУМ(ИсточникЗагрузки),
	|	МАКСИМУМ(ВстречноеПоручение),
	|	МАКСИМУМ(ДатаВстречногоПоручения),
	|	МАКСИМУМ(НомерВстречногоПоручения)
	|ПО
	|	Поручение";
	
КонецФункции

Функция ТекстПисьмаДляСписанияЗачисленияЦБ(Выборка, ПереносСтроки)
	
	ТекстПисьма = 
	"На основании поручения %НомерПоручения от %ДатаПоручения клиента %КодКлиента" + ПереносСтроки
	+ "%ТипОперации ценные бумаги" + ПереносСтроки
	+ "Источник загрузки %ИсточникЗагрузки" + ПереносСтроки
	+ "Счет депо места хранения %СчетДепоМХ" + ПереносСтроки
	+ "Раздел счета депо места хранения %РазделСчетаДепоМХ" + ПереносСтроки
	+ "Счет депо клиента %СчетДепо" + ПереносСтроки
	+ "Раздел счета депо клиента %РазделСчетаДепо" + ПереносСтроки
	+ "%ДанныеЦБ";
	ТекстПисьма = СтрЗаменить(ТекстПисьма, "%НомерПоручения", СокрЛП(Выборка.НомерПоручения));
	ТекстПисьма = СтрЗаменить(ТекстПисьма, "%ДатаПоручения", СокрЛП(Выборка.ДатаПоручения));
	ТекстПисьма = СтрЗаменить(ТекстПисьма, "%КодКлиента", СокрЛП(Выборка.КодДепонента));
	ТекстПисьма = СтрЗаменить(ТекстПисьма, "%ТипОперации", ?(Выборка.ВидОперации = Справочники.ВидыОпераций.СнятиеСДепонирования, "Списаны", "Зачислены"));
	Если ЗначениеЗаполнено(Выборка.ИсточникЗагрузки) Тогда
		ТекстПисьма = СтрЗаменить(ТекстПисьма, "%ИсточникЗагрузки", СокрЛП(Выборка.ИсточникЗагрузки));
	Иначе 
		ТекстПисьма = СтрЗаменить(ТекстПисьма, "%ИсточникЗагрузки", "Нет");
	КонецЕсли;
	ТекстПисьма = СтрЗаменить(ТекстПисьма, "%СчетДепоМХ", СокрЛП(Выборка.СчетДепоМХ));
	ТекстПисьма = СтрЗаменить(ТекстПисьма, "%РазделСчетаДепоМХ", СокрЛП(Выборка.РазделСчетаДепоМХ));
	ТекстПисьма = СтрЗаменить(ТекстПисьма, "%СчетДепо", СокрЛП(Выборка.СчетДепо));
	ТекстПисьма = СтрЗаменить(ТекстПисьма, "%РазделСчетаДепо", СокрЛП(Выборка.РазделСчетаДепо));
	ТекстПисьма = СтрЗаменить(ТекстПисьма, "%ДанныеЦБ", ТекстДанныеЦБ(Выборка, ПереносСтроки));
	
	Возврат ТекстПисьма;
	
КонецФункции

Функция ТекстПисьмаДляПереводаЦБ(Выборка, ПереносСтроки)
	
	ТекстПисьма =
	"На основании поручений клиентов %НомерПоручения от %ДатаПоручения и %НомерВстречногоПоручения от %ДатаВстречногоПоручения осуществлён" + ПереносСтроки +
	"перевод ЦБ между договорами клиентов %КодКлиентаИсточник и %КодКлиентаПриемник (без движения в м/х):" + ПереносСтроки +
	"Счет депо места хранения (списание ЦБ) %СчетДепоМХИсточник" + ПереносСтроки +
	"Счет депо места хранения (зачисление ЦБ) %СчетДепоМХПриемник" + ПереносСтроки +
	"Раздел счета депо места хранения (списание ЦБ) %РазделСчетаДепоМХИсточник" + ПереносСтроки +
	"Раздел счета депо места хранения (зачисление ЦБ) %РазделСчетаДепоМХПриемник" + ПереносСтроки +
	"Счет депо клиента (списание ЦБ) %СчетДепоИсточник" + ПереносСтроки +
	"Счет депо клиента (зачисление ЦБ) %СчетДепоПриемник" + ПереносСтроки +
	"%ДанныеЦБ" +
	"%ТекстTAX";
	ТекстПисьма = СтрЗаменить(ТекстПисьма, "%НомерПоручения", СокрЛП(Выборка.НомерПоручения));
	ТекстПисьма = СтрЗаменить(ТекстПисьма, "%ДатаПоручения", СокрЛП(Выборка.ДатаПоручения));
	ТекстПисьма = СтрЗаменить(ТекстПисьма, "%НомерВстречногоПоручения", СокрЛП(Выборка.НомерВстречногоПоручения));
	ТекстПисьма = СтрЗаменить(ТекстПисьма, "%ДатаВстречногоПоручения", СокрЛП(Выборка.ДатаВстречногоПоручения));
	ТекстПисьма = СтрЗаменить(ТекстПисьма, "%КодКлиентаИсточник", СокрЛП(Выборка.КодДепонента));
	ТекстПисьма = СтрЗаменить(ТекстПисьма, "%КодКлиентаПриемник", СокрЛП(Выборка.КодКонтрагента));
	ТекстПисьма = СтрЗаменить(ТекстПисьма, "%СчетДепоМХИсточник", СокрЛП(Выборка.СчетДепоМХ));
	ТекстПисьма = СтрЗаменить(ТекстПисьма, "%СчетДепоМХПриемник", СокрЛП(Выборка.СчетДепоМХКонтрагента));
	ТекстПисьма = СтрЗаменить(ТекстПисьма, "%РазделСчетаДепоМХИсточник", СокрЛП(Выборка.РазделСчетаДепоМХ));
	ТекстПисьма = СтрЗаменить(ТекстПисьма, "%РазделСчетаДепоМХПриемник", СокрЛП(Выборка.РазделСчетаДепоМХКонтрагента));
	ТекстПисьма = СтрЗаменить(ТекстПисьма, "%СчетДепоИсточник", СокрЛП(Выборка.СчетДепо));
	ТекстПисьма = СтрЗаменить(ТекстПисьма, "%СчетДепоПриемник", СокрЛП(Выборка.СчетДепоКонтрагента));
	ТекстПисьма = СтрЗаменить(ТекстПисьма, "%ДанныеЦБ", ТекстДанныеЦБ(Выборка, ПереносСтроки));
	
	Если Выборка.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
		ТекстTAX = 
		"ЦБ списаны без подтверждения налога, в 1С ИЦ налог исчислен и ожидает подтверждения от TAX dpt на уплату в бюджет." + ПереносСтроки +
		"Для уплаты налога применяем срок, установленный законодательством – 1 месяц.";
		ТекстПисьма = СтрЗаменить(ТекстПисьма, "%ТекстTAX", ПереносСтроки + ТекстTAX);
	Иначе
		ТекстПисьма = СтрЗаменить(ТекстПисьма, "%ТекстTAX", "");
	КонецЕсли;

	Возврат ТекстПисьма;
	
КонецФункции

Функция ТекстПисьмаДляПереводовВнутриОдногоСчета(Выборка, ПереносСтроки)
	
	ТекстПисьма =
	"На основании поручения %НомерПоручения от %ДатаПоручения клиента %КодКлиента осуществлён" + ПереносСтроки +
	"перевод цб по разделам счета депо клиента:" + ПереносСтроки +
	"Счет депо места хранения %СчетДепоМХ" + ПереносСтроки +
	"Раздел счета депо места хранения (списание цб) %РазделСчетаДепоМХИсточник" + ПереносСтроки +
	"Раздел счета депо места хранения (зачисление ЦБ) %РазделСчетаДепоМХПриемник" + ПереносСтроки +
	"Счет депо клиента %СчетДепо" + ПереносСтроки +
	"Раздел счета депо (списание цб) %РазделСчетаДепоИсточник" + ПереносСтроки +
	"Раздел счета депо (зачисление цб) %РазделСчетаДепоПолучатель" + ПереносСтроки +
	"%ДанныеЦБ";
	ТекстПисьма = СтрЗаменить(ТекстПисьма, "%НомерПоручения", СокрЛП(Выборка.НомерПоручения));
	ТекстПисьма = СтрЗаменить(ТекстПисьма, "%ДатаПоручения", СокрЛП(Выборка.ДатаПоручения));
	ТекстПисьма = СтрЗаменить(ТекстПисьма, "%КодКлиента", СокрЛП(Выборка.КодДепонента));
	ТекстПисьма = СтрЗаменить(ТекстПисьма, "%СчетДепоМХ", СокрЛП(Выборка.СчетДепоМХ));
	ТекстПисьма = СтрЗаменить(ТекстПисьма, "%РазделСчетаДепоМХИсточник", СокрЛП(Выборка.РазделСчетаДепоМХ));
	ТекстПисьма = СтрЗаменить(ТекстПисьма, "%РазделСчетаДепоМХПриемник", СокрЛП(Выборка.РазделСчетаДепоМХКонтрагента));
	ТекстПисьма = СтрЗаменить(ТекстПисьма, "%СчетДепо", СокрЛП(Выборка.СчетДепо));
	ТекстПисьма = СтрЗаменить(ТекстПисьма, "%РазделСчетаДепоИсточник", СокрЛП(Выборка.РазделСчетаДепо));
	ТекстПисьма = СтрЗаменить(ТекстПисьма, "%РазделСчетаДепоПолучатель", СокрЛП(Выборка.РазделСчетаДепоКонтрагента));
	ТекстПисьма = СтрЗаменить(ТекстПисьма, "%ДанныеЦБ", ТекстДанныеЦБ(Выборка, ПереносСтроки));
	
	Возврат ТекстПисьма;
	
КонецФункции

Функция ТекстПисьмаДляПеремещений(Выборка, ПереносСтроки)
	
	ТекстПисьма =
	"На основании поручения клиентов %НомерПоручения от %ДатаПоручения осуществлён" + ПереносСтроки +
	"перевод ЦБ между счетами депо клиента %КодКлиентаИсточник:" + ПереносСтроки +

	"Счет депо места хранения (списание ЦБ) %СчетДепоМХИсточник" + ПереносСтроки +
	"Счет депо места хранения (зачисление ЦБ) %СчетДепоМХПриемник" + ПереносСтроки +
	"Раздел счета депо места хранения (списание ЦБ) %РазделСчетаДепоМХИсточник" + ПереносСтроки +
	"Раздел счета депо места хранения (зачисление ЦБ) %РазделСчетаДепоМХПриемник" + ПереносСтроки +
	"Счет депо клиента (списание ЦБ) %СчетДепоИсточник" + ПереносСтроки +
	"Счет депо клиента (зачисление ЦБ) %СчетДепоПриемник" + ПереносСтроки +
	"Раздел счета депо (списание цб) %РазделСчетаДепоИсточник" + ПереносСтроки +
	"Раздел счета депо (зачисление цб) %РазделСчетаДепоПриемник" + ПереносСтроки +
	"%ДанныеЦБ";
	ТекстПисьма = СтрЗаменить(ТекстПисьма, "%НомерПоручения", СокрЛП(Выборка.НомерПоручения));
	ТекстПисьма = СтрЗаменить(ТекстПисьма, "%ДатаПоручения", СокрЛП(Выборка.ДатаПоручения));
	ТекстПисьма = СтрЗаменить(ТекстПисьма, "%КодКлиентаИсточник", СокрЛП(Выборка.КодДепонента));
	ТекстПисьма = СтрЗаменить(ТекстПисьма, "%СчетДепоМХИсточник", СокрЛП(Выборка.СчетДепоМХ));
	ТекстПисьма = СтрЗаменить(ТекстПисьма, "%СчетДепоМХПриемник", СокрЛП(Выборка.СчетДепоМХКонтрагента));
	ТекстПисьма = СтрЗаменить(ТекстПисьма, "%РазделСчетаДепоМХИсточник", СокрЛП(Выборка.РазделСчетаДепоМХ));
	ТекстПисьма = СтрЗаменить(ТекстПисьма, "%РазделСчетаДепоМХПриемник", СокрЛП(Выборка.РазделСчетаДепоМХКонтрагента));
	ТекстПисьма = СтрЗаменить(ТекстПисьма, "%СчетДепоИсточник", СокрЛП(Выборка.СчетДепо));
	ТекстПисьма = СтрЗаменить(ТекстПисьма, "%СчетДепоПриемник", СокрЛП(Выборка.СчетДепоКонтрагента));
	ТекстПисьма = СтрЗаменить(ТекстПисьма, "%РазделСчетаДепоИсточник", СокрЛП(Выборка.РазделСчетаДепо));
	ТекстПисьма = СтрЗаменить(ТекстПисьма, "%РазделСчетаДепоПриемник", СокрЛП(Выборка.РазделСчетаДепоКонтрагента));
	ТекстПисьма = СтрЗаменить(ТекстПисьма, "%ДанныеЦБ", ТекстДанныеЦБ(Выборка, ПереносСтроки));
	
	Возврат ТекстПисьма;
	
КонецФункции

Процедура ЗаписатьСостояниеПодготовленДляПоручения(Поручение, ДатаПодготовки);
	
	Запись = РегистрыСведений.СостоянияУведомленийОбОперацияхСЦБ.СоздатьМенеджерЗаписи();
	Запись.Поручение = Поручение;
	Запись.Подготовлено = Истина;
	Запись.ДатаПодготовлено = ДатаПодготовки;
	Запись.Записать();
	
КонецПроцедуры

Функция ТекстДанныеЦБ(Выборка, ПереносСтроки)
	ТекстДанныеЦБ = "";
	ДанныеЦБ = Выборка.Выбрать();
	Пока ДанныеЦБ.Следующий() Цикл
		ТекстДанныеЦБ = ТекстДанныеЦБ + ?(ПустаяСтрока(ТекстДанныеЦБ), "", ПереносСтроки)
		+ СтрШаблон("ISIN %1, %2; Количество ценных бумаг %3",
		СокрЛП(ДанныеЦБ.ISIN), СокрЛП(ДанныеЦБ.ЦБПредставление), СокрЛП(ДанныеЦБ.КоличествоЦБ));
	КонецЦикла;
	Возврат ТекстДанныеЦБ;
КонецФункции

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);
